In [190]:
import numpy as np
import pandas as pd

# SERIES/SERİLER

numpy dizileri üzerinde inşa edilmiştir fakat burada biraz daha esnek davranabiliyoruz
pandasa veri biliminin exceli derler

Serileri birçok farklı şeyden oluşturabiliriz.Örneğin listelerden ,numpy dizilerinden,sözlüklerden gibi birçok şeyden oluşturabiliriz

SÖZLÜKLER

In [191]:
myDic={"Ayşe":27,"Aysun":21,"Nur":35}

In [192]:
pd.Series(myDic)#veri biliminin exceli denmesindeki sebep verdiği çıktının düzeninden kaynaklanmaktadır

Ayşe     27
Aysun    21
Nur      35
dtype: int64

LİSTELER

In [193]:
myListData=[20,40,30]
myListIndex=["Ayşe","Mehmet","Arzu"]

In [194]:
pd.Series(myListData)#kendisi default olarak index atar

0    20
1    40
2    30
dtype: int64

In [195]:
pd.Series(myListData,myListIndex)

Ayşe      20
Mehmet    40
Arzu      30
dtype: int64

In [196]:
pd.Series(data=myListData,index=myListIndex)#bu şeklide bir yazım şekli ile daha temiz bir kod yazmış oluruz

Ayşe      20
Mehmet    40
Arzu      30
dtype: int64

NUMPY ARRAY

In [197]:
myList=list(range(1,8))
myList

[1, 2, 3, 4, 5, 6, 7]

In [198]:
myArray=np.array(myList)
myArray

array([1, 2, 3, 4, 5, 6, 7])

In [199]:
mySeries=pd.Series(myArray)
mySeries

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [200]:
#eğer default index dışında index atamak istersek len(data)==len(index) olmalıdır
#yoksa error verir
mySeries=pd.Series(myArray)

# SERIES ÖZELLİKLERİ

In [201]:
mySerıes2=pd.Series(["ayşe","fatma","gül"],[80,70,87])

In [202]:
mySerıes2

80     ayşe
70    fatma
87      gül
dtype: object

In [203]:
diffSeries1=pd.Series([25,35,23],["ayşe","nur","elif"])

In [204]:
diffSeries2=pd.Series([12,24,12],["ayşe","nur","elif"])

In [205]:
additionSeries=diffSeries1+diffSeries2

In [206]:
additionSeries

ayşe    37
nur     59
elif    35
dtype: int64

In [207]:
#eğer toplama işlemi yapılırken kesişmeyen elemanlar olursa

In [208]:
diffSeries3=pd.Series([12,13,24],["ayşe","nur","harun"])
diffSeries4=pd.Series([13,24,53],["ayşe","güneş","nur"])

In [209]:
additionSeries2=diffSeries3+diffSeries4

In [210]:
additionSeries2

ayşe     25.0
güneş     NaN
harun     NaN
nur      66.0
dtype: float64

# DATAFRAME(VERİ ÇERÇEVESİ)

Aslında dateframeleri ,serilerin birleştirilmiş hali gibi düşünebiliyoruz
Serilerin yanyana gelmesinden oluşturulmuş bir excel tablosu gibi düşünülebilinir

In [211]:
#ilk başta random veriler üretelim

In [212]:
data=np.random.randn(4,3)

In [213]:
dateFrame=pd.DataFrame(data)#üretilen bu veriler dataframe nesnesine dönüştürülüyr

In [214]:
dateFrame

          0         1         2
0  1.753769 -0.152518 -0.068340
1  1.006860  0.856811  0.487538
2  1.300690 -0.713095  0.836333
3 -0.094269 -1.105592  1.594716

In [215]:
dateFrame[0]#parametre kolon bazlı çalışır

0    1.753769
1    1.006860
2    1.300690
3   -0.094269
Name: 0, dtype: float64

In [216]:
#eğer bu row ve kolonların isimlerini değiştirmek istersek

In [217]:
newDateFrame=pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [218]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [219]:
newDateFrame["Yas"]

Atil     -0.152518
Zeynep    0.856811
Atlas    -0.713095
Mehmet   -1.105592
Name: Yas, dtype: float64

In [220]:
#birden fazla kolonu parametre olarak girebiliriz

In [221]:
newDateFrame[["Yas","Maas"]]#ikinci köşeli parantezi unutma

             Yas      Maas
Atil   -0.152518  1.753769
Zeynep  0.856811  1.006860
Atlas  -0.713095  1.300690
Mehmet -1.105592 -0.094269

In [222]:
#eğer kolon yerine satırlara  ulaşmak istersek

In [223]:
newDateFrame.loc["Atil"]#lokasyondan gelmektedir

Maas             1.753769
Yas             -0.152518
Calisma Saati   -0.068340
Name: Atil, dtype: float64

In [224]:
#eğer index üzerinden ulaşmak istersek

In [225]:
newDateFrame.iloc[1]

Maas             1.006860
Yas              0.856811
Calisma Saati    0.487538
Name: Zeynep, dtype: float64

DataFrame Indexleri

In [226]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [227]:
newDateFrame["Maas"]

Atil      1.753769
Zeynep    1.006860
Atlas     1.300690
Mehmet   -0.094269
Name: Maas, dtype: float64

Aşağıdaki işlemle dataframe yeni bir kolon eklenmiş oldu

In [228]:
newDateFrame["Emeklilik Yasi"]=pd.DataFrame([65,56,53,55],["Atil","Zeynep","Atlas","Mehmet"])

In [229]:
newDateFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.753769 -0.152518      -0.068340              65
Zeynep  1.006860  0.856811       0.487538              56
Atlas   1.300690 -0.713095       0.836333              53
Mehmet -0.094269 -1.105592       1.594716              55

Eğer bu dataframeden bir kolon silmek istersek

In [230]:
#newDateFrame.drop("Emeklilik Yasi")#drop dediğimizde rowda aradığından 
#girdiğim parametrede bir kolon olduğundan
#"['Emeklilik Yasi'] not found in axis" hatasını verir

In [231]:
newDateFrame.drop("Emeklilik Yasi",axis=1)#axis=eksen demektir-->axis=1 kolondur

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [232]:
#axis=0 ise row yani satırdır-->zaten drop fonk default axis=0 dır eğer 
#kolon düşürmek istersek axis=1 ifadesini belirtmek zorundayız

In [233]:
newDateFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.753769 -0.152518      -0.068340              65
Zeynep  1.006860  0.856811       0.487538              56
Atlas   1.300690 -0.713095       0.836333              53

In [234]:
newDateFrame#buradan görüldüğü üzere yukarıda yaptığımız hiçbir değişiklik
#yani satır ve kolon silme işlemlerinin hiçbirinin asıl dataframe üzerinde 
#kaydedilmediğini görüyoruz

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.753769 -0.152518      -0.068340              65
Zeynep  1.006860  0.856811       0.487538              56
Atlas   1.300690 -0.713095       0.836333              53
Mehmet -0.094269 -1.105592       1.594716              55

In [235]:
#bu işlemlerin asıl dataframe üzerinde de gerçekleşmesini istiyorsak
#bunu belirtmemiz gerekiyor

In [236]:
newDateFrame.drop("Emeklilik Yasi",axis=1,inplace=True)#inplace yerinde demektir
#buradaki inplace in def değeri False dur
#bu yüzden yapılan değişiklikler asıl dataframe üzerinde gerçekleştirilmez

In [237]:
#silme işlemi sadece bir kez gerçekleştirileceğinden yukarıdaki hücrenin
#birden fazla kez çağrılması hataya sebep olur

In [238]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [239]:
newDateFrame.loc["Atil"]["Calisma Saati"]

-0.06834010430272246

In [240]:
newDateFrame.loc["Atil","Calisma Saati"]

-0.06834010430272246

In [241]:
#eğer 0 dan küçük değerleri göstemek istersek

In [242]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [243]:
newDateFrame<0

         Maas    Yas  Calisma Saati
Atil    False   True           True
Zeynep  False  False          False
Atlas   False   True          False
Mehmet   True   True          False

In [244]:
#eğer sadece true değerleri göstemek istersek

In [245]:
booleanDateFrame=newDateFrame<0

In [246]:
newDateFrame[booleanDateFrame]

            Maas       Yas  Calisma Saati
Atil         NaN -0.152518       -0.06834
Zeynep       NaN       NaN            NaN
Atlas        NaN -0.713095            NaN
Mehmet -0.094269 -1.105592            NaN

In [247]:
newDateFrame[newDateFrame<0]

            Maas       Yas  Calisma Saati
Atil         NaN -0.152518       -0.06834
Zeynep       NaN       NaN            NaN
Atlas        NaN -0.713095            NaN
Mehmet -0.094269 -1.105592            NaN

In [248]:
#kolonlar arasında işlem yapmak

In [249]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [250]:
newDateFrame[newDateFrame["Yas"]>0]#yaşı sıfırdan büyük olanları gösterdiğinden 
#zeynep satırını göstermedi

           Maas       Yas  Calisma Saati
Zeynep  1.00686  0.856811       0.487538

In [251]:
newDateFrame[newDateFrame["Calisma Saati"]>0]

            Maas       Yas  Calisma Saati
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

INDEX DEĞİŞTİRME

In [252]:
newDateFrame

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [253]:
newDateFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  1.753769 -0.152518      -0.068340
1  Zeynep  1.006860  0.856811       0.487538
2   Atlas  1.300690 -0.713095       0.836333
3  Mehmet -0.094269 -1.105592       1.594716

In [254]:
newDateFrame#aşağıdaki çıktıdan da anlaşılacağı üzere

#ana dataframe üzerinde yapılan değişiklikler kaydedilmemiş 
#bunun kaydedilmesi için "inplace=True" yapılmalıdır

            Maas       Yas  Calisma Saati
Atil    1.753769 -0.152518      -0.068340
Zeynep  1.006860  0.856811       0.487538
Atlas   1.300690 -0.713095       0.836333
Mehmet -0.094269 -1.105592       1.594716

In [255]:
#eğer var olan bir index listesi değiştirilmek istenirse ve yapılan bu değişiklik 
#ana dataframe üzerinde gerçekleştirilip kaydedilmek istenilirse

In [256]:
newIndexList=["Ati","Zey","Atl","Meh"]

In [257]:
#yukarıdaki index bilgilerini set etmeden önce bunu bir kolon olarak 
#bu tabloya yazdırmamız lazım

In [258]:
newDateFrame["New Index"]=newIndexList

In [259]:
newDateFrame

            Maas       Yas  Calisma Saati New Index
Atil    1.753769 -0.152518      -0.068340       Ati
Zeynep  1.006860  0.856811       0.487538       Zey
Atlas   1.300690 -0.713095       0.836333       Atl
Mehmet -0.094269 -1.105592       1.594716       Meh

In [260]:
newDateFrame.set_index("New Index")

               Maas       Yas  Calisma Saati
New Index
Ati        1.753769 -0.152518      -0.068340
Zey        1.006860  0.856811       0.487538
Atl        1.300690 -0.713095       0.836333
Meh       -0.094269 -1.105592       1.594716

In [261]:
newDateFrame#yukarıdaki değişikliğin ana dataframe üzerinde 
#gerçekleştirilmesi için "inplace=True" yapılmalıdır

            Maas       Yas  Calisma Saati New Index
Atil    1.753769 -0.152518      -0.068340       Ati
Zeynep  1.006860  0.856811       0.487538       Zey
Atlas   1.300690 -0.713095       0.836333       Atl
Mehmet -0.094269 -1.105592       1.594716       Meh

In [262]:
newDateFrame.set_index("New Index",inplace=True)#set etmeden önce dataframe kolon olarak eklenmelidir

In [263]:
newDateFrame

               Maas       Yas  Calisma Saati
New Index
Ati        1.753769 -0.152518      -0.068340
Zey        1.006860  0.856811       0.487538
Atl        1.300690 -0.713095       0.836333
Meh       -0.094269 -1.105592       1.594716

In [264]:
#yukarıda yapıan değişikliğin ana dataframe üzerinde kaydedilip kaydedilmediğini
#konrol etmek için:

In [265]:
newDateFrame.loc["Ati"]

Maas             1.753769
Yas             -0.152518
Calisma Saati   -0.068340
Name: Ati, dtype: float64

MULTI INDEX

In [266]:
#şuan bu konuyu anlatmak için üzerinde çalışacağımız dataframede iki index var
#dış index ve iç index olmak üzere
#dış index=marvel ve dc(bu merge edilmiş hali)
#normalde=marvel,marvel,marvel,DC,DC,DC şeklidedir

#iç index=spiderman,ıronman,captan america,batman,superman,flash

In [267]:
disIndex=["Marvel","Marvel","Marvel","DC","DC","DC"]

In [268]:
icIndex=["Spiderman","Ironman","Captan America","Batman","Superman","Flash"]

In [269]:
birlesmisIndex=list(zip(disIndex,icIndex))

In [270]:
birlesmisIndex

[('Marvel', 'Spiderman'),
 ('Marvel', 'Ironman'),
 ('Marvel', 'Captan America'),
 ('DC', 'Batman'),
 ('DC', 'Superman'),
 ('DC', 'Flash')]

In [271]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [272]:
birlesmisIndex

MultiIndex([('Marvel',      'Spiderman'),
            ('Marvel',        'Ironman'),
            ('Marvel', 'Captan America'),
            (    'DC',         'Batman'),
            (    'DC',       'Superman'),
            (    'DC',          'Flash')],
           )

In [273]:
#data listelerini oluşturalım

In [274]:
age=[40,10,30,9,10,11]

In [275]:
job=["Öğrenci","İş Adamı","Asker","İş Adamı","Gazateci","Gazateci"]

In [276]:
#şimdi dataframe oluşturalım

In [277]:
newDataFrame2=pd.DataFrame(index=birlesmisIndex)
newDataFrame2

Empty DataFrame
Columns: []
Index: [(Marvel, Spiderman), (Marvel, Ironman), (Marvel, Captan America), (DC, Batman), (DC, Superman), (DC, Flash)]

In [287]:
newDataFrame2["Job"]=job
newDataFrame2["Age"]=age

In [288]:
newDataFrame2

                            job  age       Job  Age
Marvel Spiderman        Öğrenci   40   Öğrenci   40
       Ironman         İş Adamı   10  İş Adamı   10
       Captan America     Asker   30     Asker   30
DC     Batman          İş Adamı    9  İş Adamı    9
       Superman        Gazateci   10  Gazateci   10
       Flash           Gazateci   11  Gazateci   11

In [289]:
#YUKARIDAKİ ÇIKTIYI FARKLI BİR YOLDAN DA ELDE EDEBİLİRİZ

In [282]:
index_1=[["Öğrenci",40],["İş Adamı",10],["Asker",30],
         ["İş Adamı",9],["Gazateci",10],["Gazateci",11]]

In [285]:
newDataFrame3=pd.DataFrame(data=index_1,index=birlesmisIndex,columns=["Job","Age"])

In [286]:
newDataFrame3

                            Job  Age
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [293]:

newDataFrame2.drop("Job",axis=1,inplace=True)

In [294]:
newDataFrame2

                            job  age
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [295]:
newDataFrame2["Job"]=job
newDataFrame2["Age"]=age

In [296]:
newDataFrame2

                            job  age       Job  Age
Marvel Spiderman        Öğrenci   40   Öğrenci   40
       Ironman         İş Adamı   10  İş Adamı   10
       Captan America     Asker   30     Asker   30
DC     Batman          İş Adamı    9  İş Adamı    9
       Superman        Gazateci   10  Gazateci   10
       Flash           Gazateci   11  Gazateci   11

In [297]:
newDataFrame2.drop(["job","age"],axis=1,inplace=True)

In [298]:
newDataFrame2

                            Job  Age
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [299]:
newDataFrame3

                            Job  Age
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [300]:
newDataFrame2.loc["Marvel"]

                     Job  Age
Spiderman        Öğrenci   40
Ironman         İş Adamı   10
Captan America     Asker   30

In [301]:
newDataFrame3.loc["DC"]

               Job  Age
Batman    İş Adamı    9
Superman  Gazateci   10
Flash     Gazateci   11

In [302]:
newDataFrame2.loc["Marvel"].loc["Spiderman"]

Job    Öğrenci
Age         40
Name: Spiderman, dtype: object

In [303]:
newDataFrame3.loc["DC","Batman"]

Job    İş Adamı
Age           9
Name: (DC, Batman), dtype: object

In [304]:
newDataFrame2

                            Job  Age
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [305]:
#indexlerin bulunduğu kolonları adlandırmak için :

In [311]:
newDataFrame2.index.names=["Evrenler","Süper Kahramanlar"]

In [312]:
newDataFrame2

                                 Job  Age
Evrenler Süper Kahramanlar
Marvel   Spiderman           Öğrenci   40
         Ironman            İş Adamı   10
         Captan America        Asker   30
DC       Batman             İş Adamı    9
         Superman           Gazateci   10
         Flash              Gazateci   11

In [308]:
newDataFrame3.reset_index()

  Evrenler Süper Kahramanlar       Job  Age
0   Marvel         Spiderman   Öğrenci   40
1   Marvel           Ironman  İş Adamı   10
2   Marvel    Captan America     Asker   30
3       DC            Batman  İş Adamı    9
4       DC          Superman  Gazateci   10
5       DC             Flash  Gazateci   11

In [309]:
newDataFrame2.index.names=["Evren","Kahraman"]

In [310]:
newDataFrame2

                            Job  Age
Evren  Kahraman
Marvel Spiderman        Öğrenci   40
       Ironman         İş Adamı   10
       Captan America     Asker   30
DC     Batman          İş Adamı    9
       Superman        Gazateci   10
       Flash           Gazateci   11

In [313]:
newDataFrame2

                                 Job  Age
Evrenler Süper Kahramanlar
Marvel   Spiderman           Öğrenci   40
         Ironman            İş Adamı   10
         Captan America        Asker   30
DC       Batman             İş Adamı    9
         Superman           Gazateci   10
         Flash              Gazateci   11